tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
brew "bat"
brew "coreutils"
brew "fzf"
brew "git-delta"
brew "hyperfine"
brew "jq"
brew "libevent"
brew "mitmproxy"
brew "mosh"
brew "neovim"
brew "reattach-to-user-namespace"
brew "terraform"
brew "the_silver_searcher"
brew "tmux"
brew "vault"
brew "wget"
brew "zsh"
cask "font-droidsansmono-nerd-font"
cask "kitty"
